# SQL Subqueries - Lab

## Introduction

Now that you've seen how subqueries work, it's time to get some practice writing them! Not all of the queries will require subqueries, but all will be a bit more complex and require some thought and review about aggregates, grouping, ordering, filtering, joins and subqueries. Good luck!  

## Objectives

You will be able to:

* Write subqueries to decompose complex queries

## CRM Database Schema

Once again, here's the schema for the CRM database you'll continue to practice with.

<img src="images/Database-Schema.png" width="600">

## Connect to the Database

As usual, start by importing the necessary packages and connecting to the database **data.sqlite**.

In [1]:
import sqlite3
import pandas as pd

In [2]:
conn = sqlite3.Connection('data.sqlite')
c = conn.cursor()

## Select the Average Number of Orders on a Product by Product Basis

In [3]:
c.execute("""select AVG(numOrders)
                    from (select COUNT(*) as numOrders FROM orderDetails GROUP BY productCode);
          """
         )
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

   AVG(numOrders)
0       27.486239

## Write an Equivalent Query using a Subquery

```SQL
select customerNumber,
       contactLastName,
       contactFirstName
       from customers
       join orders 
       using(customerNumber)
       where orderDate = '2003-01-31';
```

<img src="images/Database-Schema.png" width="600">

In [8]:
c.execute("""select customerNumber,
       contactLastName,
       contactFirstName
       from customers
       join orders 
       using(customerNumber)
       where orderDate = '2003-01-31';"""
         )
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

  customerNumber contactLastName contactFirstName
0            141          Freyre           Diego

In [9]:
c.execute("""SELECT customerNumber, contactLastName, contactFirstName
            FROM customers WHERE customerNumber IN (SELECT customerNumber FROM orders WHERE orderDate = '2003-01-31')
          """
         )
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

  customerNumber contactLastName contactFirstName
0            141          Freyre           Diego

## Select the Total Number of Orders for Each Product Name

Sort the results by the total number of items sold for that product.

<img src="images/Database-Schema.png" width="600">

In [15]:
c.execute("""SELECT productName, COUNT(*), s FROM orderDetails
             JOIN products USING(productCode)
             GROUP BY productName
             ORDER BY SUM(quantityOrdered) as sumQuantityOrdered
"""
         )
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

                                 productName  COUNT(*)
0                      1957 Ford Thunderbird        24
1                 1970 Chevy Chevelle SS 454        25
2           1936 Mercedes Benz 500k Roadster        25
3                         1911 Ford Town Car        25
4               1999 Indy 500 Monte Carlo SS        25
5        1932 Alfa Romeo 8C2300 Spider Sport        25
6          1992 Porsche Cayenne Turbo Silver        27
7                  1969 Chevrolet Camaro Z28        25
8                          1952 Citroen-15CV        24
9                     1928 Mercedes-Benz SSK        28
10                         1903 Ford Model A        27
11                 1937 Horch 930V Limousine        28
12                       2002 Chevy Corvette        25
13               American Airlines: B767-300        28
14                            The Queen Mary        27
15                                HMS Bounty        28
16                 1974 Ducati 350 Mk3 Desmo        27
17                             The Mayflower        27
18                   1970 Plymouth Hemi Cuda        27
19                         1982 Ducati 996 R        27
20       18th Century Vintage Horse Carriage        28
21               1980’s GM Manhattan Express        28
22                   1982 Lamborghini Diablo        27
23                     1965 Aston Martin DB5        25
24                 1966 Shelby Cobra 427 S/C        25
25                     1976 Ford Gran Torino        27
26                          1995 Honda Civic        27
27                            P-51-D Mustang        28
28                  1917 Grand Touring Sedan        25
29                  Collectable Wooden Train        27
..                                       ...       ...
79                   1939 Cadillac Limousine        28
80                           1982 Camaro Z28        28
81                     1926 Ford Fire Engine        28
82                    1940 Ford Pickup Truck        28
83                     1996 Moto Guzzi 1100i        28
84                   1900s Vintage Tri-Plane        28
85                     18th century schooner        27
86                 1957 Corvette Convertible        27
87                          1997 BMW F650 ST        28
88                  1960 BSA Gold Star DBD34        28
89                         2001 Ferrari Enzo        27
90                 The USS Constitution Ship        27
91                          2002 Suzuki XREO        28
92                  1962 Volkswagen Microbus        28
93                       1972 Alfa Romeo GTA        28
94                         1997 BMW R 1100 S        28
95               1913 Ford Model T Speedster        28
96               1980s Black Hawk Helicopter        28
97                        F/A 18 Hornet 1/72        28
98                  Corsair F4U ( Bird Cage)        28
99                   1956 Porsche 356A Coupe        27
100                   1964 Mercedes Tour Bus        28
101                        1957 Chevy Pickup        28
102    1969 Harley Davidson Ultimate Chopper        28
103                         1940s Ford truck        28
104             1930 Buick Marquette Phaeton        28
105  1941 Chevrolet Special Deluxe Cabriolet        28
106                American Airlines: MD-11S        28
107                     1937 Lincoln Berline        28
108              1992 Ferrari 360 Spider red        53

[109 rows x 2 columns]

In [12]:
c.execute("""SELECT productName, numOrders FROM products WHERE productCode IN 
(SELECT productCode, COUNT(*) AS numOrders FROM orderdetails GROUP BY productCode)
          """
         )
df = pd.DataFrame(c.fetchall())
df.columns = [x[0] for x in c.description]
df

OperationalError: no such column: numOrders

## Select the Product Name and the  Total Number of People Who Have Ordered Each Product

Sort the results in descending order.

In [ ]:
#Your code here

## Select the Employee Number, Office Code, City (of the office), and Name (First and Last) of those Employees who Sold Products that Have Been Ordered by Less Then 20 people.

This problem is a bit tougher. To start, think about how you might break the problem up. Be sure that your results only list each employee once.

In [ ]:
#Your code here

## Select the Employee Number, Name (First and Last) and Number of Customers of Employees Who's Customers Have an Average Credit Limit of Over 15K

In [ ]:
#Your code here

## Summary

In this lesson, you got to practice some more complex SQL queries, some of which required subqueries. There's still plenty more SQL to be had though; hope you've been enjoying some of these puzzles!